; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v13)
             (pred_12 ?v3 ?v1)
             (pred_2 ?v7 ?v1)
             (pred_1 ?v5 ?v7 )
	     (pred_10 ?v7)
             (pred_8 ?v10)
             (pred_7 ?v3)
             (pred_4 ?v1)
             (pred_5 ?v7)
             (pred_9 ?v3)
             (pred_3 ?v7)
             (pred_6 ))



(:action op_5
:parameters (?v9 ?v2 ?v8 ?v11)
:precondition (and (pred_8 ?v9) (pred_8 ?v2) (pred_7 ?v8) (pred_4 ?v11)
          (pred_11 ?v9 ?v2) (pred_12 ?v8 ?v11)
                   (pred_2 ?v2 ?v11) (pred_10 ?v9) 
                   (pred_5 ?v2) (pred_9 ?v8))
:effect (and  (pred_3 ?v2) (not (pred_5 ?v2))))


(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_8 ?v9) (pred_8 ?v6)
               (pred_10 ?v9) (pred_11 ?v9 ?v6) (pred_3 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v9))))

(:action op_2
:parameters (?v9 ?v8)
:precondition (and (pred_8 ?v9) (pred_7 ?v8) 
                  (pred_10 ?v9) (pred_1 ?v8 ?v9) (pred_6 ))
:effect (and (pred_9 ?v8)
   (not (pred_1 ?v8 ?v9)) (not (pred_6 ))))


(:action op_1
:parameters (?v9 ?v4 ?v12)
:precondition (and (pred_8 ?v9) (pred_7 ?v4) (pred_7 ?v12)
                  (pred_10 ?v9) (pred_9 ?v12) (pred_1 ?v4 ?v9))
:effect (and (pred_9 ?v4) (pred_1 ?v12 ?v9)
        (not (pred_9 ?v12)) (not (pred_1 ?v4 ?v9))))

(:action op_3
:parameters (?v9 ?v8)
:precondition (and (pred_8 ?v9) (pred_7 ?v8) 
                  (pred_10 ?v9) (pred_9 ?v8))
:effect (and (pred_6 ) (pred_1 ?v8 ?v9) (not (pred_9 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_01 obj_04 obj_19 obj_15 obj_16 obj_09 obj_07 obj_10 obj_18 obj_20 obj_17 obj_06 obj_13 obj_05 obj_12
    obj_14 obj_03
    obj_08 obj_02
    )

    (:init
       (pred_6)

       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_04)
       (pred_8 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_16)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_05)
       (pred_8 obj_12)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_02)

       (pred_11 obj_11 obj_15)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_19)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_19 obj_04)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_11)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_20)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_18)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_12 obj_05)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_2  obj_11 obj_14)
       (pred_2  obj_20 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_04)
       (pred_3 obj_19)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_3 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_12)

       (pred_12  obj_08 obj_14)
       (pred_12  obj_02 obj_03)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_02 obj_10)
       (pred_10 obj_13)
    )

    (:goal (and
       (pred_1 obj_08 obj_13)
    ))
(:constraints
  (always (not (pred_10 obj_05)))
)
)

; plan
1. (op_4 obj_13 obj_18)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_4 obj_18 obj_10)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_10)
   goals met: 0 of 1
3. (op_2 obj_10 obj_02)
   deleted: (pred_1 obj_02 obj_10) (pred_6)
   added: (pred_9 obj_02)
   goals met: 0 of 1
4. (op_4 obj_10 obj_18)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_18)
   goals met: 0 of 1
5. (op_5 obj_18 obj_20 obj_02 obj_03)
   deleted: (pred_5 obj_20)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_4 obj_18 obj_13)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_6) (pred_1 obj_02 obj_13)
   goals met: 0 of 1
8. (op_4 obj_13 obj_18)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_18)
   goals met: 0 of 1
9. (op_4 obj_18 obj_20)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_20)
   goals met: 0 of 1
10. (op_4 obj_20 obj_17)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_17)
   goals met: 0 of 1
11. (op_4 obj_17 obj_12)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_12)
   goals met: 0 of 1
12. (op_2 obj_12 obj_08)
   deleted: (pred_1 obj_08 obj_12) (pred_6)
   added: (pred_9 obj_08)
   goals met: 0 of 1
13. (op_4 obj_12 obj_17)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_17)
   goals met: 0 of 1
14. (op_4 obj_17 obj_20)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_20)
   goals met: 0 of 1
15. (op_4 obj_20 obj_18)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_18)
   goals met: 0 of 1
16. (op_4 obj_18 obj_13)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_13)
   goals met: 0 of 1
17. (op_1 obj_13 obj_02 obj_08)
   deleted: (pred_9 obj_08) (pred_1 obj_02 obj_13)
   added: (pred_9 obj_02) (pred_1 obj_08 obj_13)
   goals met: 1 of 1
